```
Terraform will perform the following actions:

  # azurerm_public_ip.ldap_jenkins_io_ipv4 will be created
  + resource "azurerm_public_ip" "ldap_jenkins_io_ipv4" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "eastus2"
      + name                    = "ldap-jenkins-io-ipv4"
      + resource_group_name     = "ldap"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
      + tags                    = {
          + "repository" = "jenkins-infra/azure"
          + "scope"      = "terraform-managed"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```